app/controllers/activities_controller.rb

SELECT "activities"."id" FROM "activities" WHERE "activities"."user_id" = ?  [["user_id", 1]]
---
  def index
    @activities = User.activities.all

INSERT INTO "activities" ("date", "duration", "created_at", "updated_at", "user_id", "activity_type_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2019-04-17 00:00:00"], ["duration", 23], ["created_at", "2019-04-16 21:41:14.147261"], ["updated_at", "2019-04-16 21:41:14.147261"], ["user_id", 1], ["activity_type_id", 2]]
---
  def create
    @activity = Activity.new(activity_params)

    respond_to do |format|
      if @activity.save

UPDATE "activities" SET "date" = ?, "updated_at" = ? WHERE "activities"."id" = ?  [["date", "2019-04-15 00:00:00"], ["updated_at", "2019-04-14 16:28:10.741253"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @activity.update(activity_params)