app/views/activities/_form.html.erb

    <%= form.label :name %>
    <%= form.collection_select(:activity_type_id, ActivityType.all, :id, :name, {:prompt => 'Select an Acitvity'}, id: "activity_name" ) %>
---
SELECT "activity_types".* FROM "activity_types"